[
  {
    "job": "Cook",
    "ability": "Ships Cook",
    "rank": 1,
    "rankName": "green",
    "description": "When purchasing rations and supplies you can appropriately buy the necessary food to sustain the ships crew with a healthy and balanced diet. As long as you have adequate spices and flavorings you can make enjoyable meals out of magically created sustenance. You can prepare a meal for the entire crew in 30 minutes. If you do 1 hour of preparation the next 3 meals you make within 24 hours only take 5 minutes to prepare. A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared regains 1d10 hitpoints. A creature can only gain this benefit from your food once a day."
  },
  {
    "job": "Cook",
    "ability": "Restful Meal",
    "rank": 2,
    "rankName": "novice",
    "description": "A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared gains the benefits of a short rest. A creature can only gain this benefit from your food once a day."
  },
  {
    "job": "Cook",
    "ability": "Pots and Pans (at least Novice in Gunner required)",
    "rank": 2,
    "rankName": "novice",
    "description": "You are proficient with your cooking implements when using them as improvised weapons. Your utensils deal 1d6 damage and are considered light. The damage type can be bludgeoning, piercing, or slashing damage based on the utensil type. A utensil can have other properties (finesse, thrown, etc.) depending on the utensil, ask your DM if you have an idea in mind."
  },
  {
    "job": "Cook",
    "ability": "Antitoxin",
    "rank": 3,
    "rankName": "intermediate",
    "description": "A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared is cured of one poison affecting it. A creature can only gain this benefit from your food once a day."
  },
  {
    "job": "Cook",
    "ability": "Bottled Antitoxin (at least Green in Engineer required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can create one dose of antitoxin during a long rest that can be drank to remove one poison affecting the creature. This dose remains potent until you create another dose this way."
  },
  {
    "job": "Cook",
    "ability": "Local Cuisine (at least Novice in Navigator required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can prepare food similar to the local food at a destination if you know that place or places similar in culture."
  },
  {
    "job": "Cook",
    "ability": "Hearty Meal",
    "rank": 4,
    "rankName": "advanced",
    "description": "A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared can gain one of the following benefits: They gain the benefit of the spell Gift of Alacrity or they have advantage on Wisdom ability checks for the next 8 hours. You choose which of the two benefits come from the meal when you prepare it. A creature can only gain this benefit from your food once a day."
  },
  {
    "job": "Cook",
    "ability": "Consistent Cook",
    "rank": 4,
    "rankName": "advanced",
    "description": "While your ship is out of supplies you can create enough food and water to keep your crew alive as if by the spell Create Food and Water. You can only do this once per day."
  },
  {
    "job": "Cook",
    "ability": "Fulfilling Meal",
    "rank": 5,
    "rankName": "expert",
    "description": "A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared can increase their current and maximum hitpoints by 1d12 or regain a spent hit die. You choose which of the two benefits come from the meal when you prepare it. A creature who gains maximum hitpoints from this feature keeps that increase for the next 24 hours. A creature can only gain this benefit from your food once a day."
  },
  {
    "job": "Cook",
    "ability": "Leader's Meal (Expert in First Mate required)",
    "rank": 5,
    "rankName": "expert",
    "description": "Once a day when you prepare a meal with at least 750 gp in food and drink used in the meal you can serve the meal while giving a rousing speech to the crew. A creature that spends at least 1 hour doing nothing but listening to you, eating, and enjoying the meal gains the benefits of the spell Heroes' Feast. A creature can only gain this benefit from your food once a day."
  },
  {
    "job": "Engineer",
    "ability": "On-The-Go Repairs",
    "rank": 1,
    "rankName": "green",
    "description": "You can spend time outside of combat to patch up the ship. For each hour you spend outside of combat repairing the ship it regains 1d4 temporary hitpoints. The ship keeps these temporary hitpoints as long as your repairs hold up (often repairs only last a few days to a few weeks without having to spend more time and materials to keep up the patchwork repairs)."
  },
  {
    "job": "Engineer",
    "ability": "Ship Status (at least Green in Helmsman required)",
    "rank": 1,
    "rankName": "green",
    "description": "You can accurately tell when your ship drops below three-quarters, half, and one-quarter of its maximum hitpoints."
  },
  {
    "job": "Engineer",
    "ability": "Damage Control",
    "rank": 2,
    "rankName": "novice",
    "description": "When you make a Survival check during combat to attempt to fix a functional portion of the ship or put out a spreading fire you have advantage on the check."
  },
  {
    "job": "Engineer",
    "ability": "Exact Status (at least Intermediate in Helmsman required)",
    "rank": 2,
    "rankName": "novice",
    "description": "While attuned to the ship you know its exact hitpoints and statuses."
  },
  {
    "job": "Engineer",
    "ability": "Repairman",
    "rank": 3,
    "rankName": "intermediate",
    "description": "Whenever you would give temporary hitpoints to the ship with On-The-Go Repairs you instead can properly repair the damage, restoring as many hitpoints as the temporary hitpoints you would have restored."
  },
  {
    "job": "Engineer",
    "ability": "Hull Coating (at least Intermediate in Navigator required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can refurbish the ship's hull to protect against the dangers of Wildspace Poison. When creatures are belowdecks they are not exposed to and do not need to save against Wildspace Poison."
  },
  {
    "job": "Engineer",
    "ability": "Lookout Post (at least Intermediate in Lookout required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can create a lookout post to aid in watches. Lookouts using your post add +3 to their passive perception."
  },
  {
    "job": "Engineer",
    "ability": "Kitchen Overhaul (at least Intermediate in Cook required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You refurbish the ship's kitchen, allowing your cook more efficient and easier preparation of meals. Your cook can prepare a meal for the entire crew in 15 minutes. If your cook spends 1 hour of preparation, the next three meals they serve within the next 24 hours are fully prepared and you can they serve those meals directly to the crew when the time to eat comes up."
  },
  {
    "job": "Engineer",
    "ability": "Comfortable Helm (at least Intermediate in Helmsman required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You add a few nice features to the Helm in order to make it easier to stand watch on. Helmsmen on watch can now stand for a full 16 hours instead of 8 before incurring exhaustion."
  },
  {
    "job": "Engineer",
    "ability": "Mounted Artillery (at least Intermediate in Gunner required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can adjust and increase the effectiveness of mounted artillery. All artillery you adjust gains +1 to all attack rolls with that artillery."
  },
  {
    "job": "Engineer",
    "ability": "Efficient Repair",
    "rank": 4,
    "rankName": "advanced",
    "description": "When you make a Survival check to attempt to fix a functional portion of the ship or put out a spreading fire you can do so as a bonus action instead of an action."
  },
  {
    "job": "Engineer",
    "ability": "Lightning Repair (at least Advanced in First Mate required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "The first time you make a Survival check to attempt to fix a functional portion of the ship or put out a spreading fire on your turn you can choose to use a free action to make the check instead of a bonus action."
  },
  {
    "job": "Engineer",
    "ability": "Marksman (at least Intermediate in Gunner required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "Your knowledge of ships and their workings increases your ability to disable them. Your attacks using a ship's artillery against another ship critically strikes on a 19 or 20."
  },
  {
    "job": "Engineer",
    "ability": "Boatswain",
    "rank": 5,
    "rankName": "expert",
    "description": " Whenever you perform or oversee On-The-Go Repairs for at least 8 hours in a single day you can repair one instance of Structural Damage. You can only repair one instance per day. Whenever you restore hitpoints to the ship, double the total number of hitpoints restored."
  },
  {
    "job": "Engineer",
    "ability": "Expert Marksman (Expert in Gunner required)",
    "rank": 5,
    "rankName": "expert",
    "description": "Your knowledge of ships and their workings further increases your ability to disable them. Once per long rest when you make an attack using a ship's artillery against another ship, you can replace the damage of the artillery you are using with the damage and effects of the spell Disintegrate."
  },
  {
    "job": "First Mate",
    "ability": "First Mate",
    "rank": 1,
    "rankName": "green",
    "description": "You know and can accurately recall the crew, roles of each crew member, passengers, cargo, watches stood, crew members on each watch, reported damage to the ship, dimensions of the ship, artillery equipped on the ship, average ship speed underway, anchor chain length, and type and number of ship's elements."
  },
  {
    "job": "First Mate",
    "ability": "Artillery Stock (at least Novice in Gunner required)",
    "rank": 1,
    "rankName": "green",
    "description": "You know and can accurately recall the strengths and uses of the ship's equipped artillery, the amount of ammunition and types of ammunition, and the intended target of each equipped artillery type (personnel, hull, rigging, etc.)."
  },
  {
    "job": "First Mate",
    "ability": "Crew's Keeper",
    "rank": 2,
    "rankName": "novice",
    "description": "You can use the help action to aid a crew member or aid a crew member's attack against a target as a bonus action once per turn."
  },
  {
    "job": "First Mate",
    "ability": "Mentor",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can cast the spell Ceremony as a ritual as long as the effect of the spell targets one of your crew members or the body of a crew member. You can replace the Coming of Age option with a ceremony for celebrating a new crew member joining the crew or a novice crew member becoming adept at their role. A crew member can only undergo this ceremony once per ship."
  },
  {
    "job": "First Mate",
    "ability": "Protector of the Ship (at least Intermediate in Engineer required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can cast the spell Warding Bond with your ship as the spell's target once per long rest."
  },
  {
    "job": "First Mate",
    "ability": "Protector of the Crew (at least Advanced in Cook required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "Your knowledge of the cook's role allows you to aid in your cook's preparation. You can gather specific ingredients to give to your cook so that they can incorporate those ingredients into their meals. Once a day your cook can prepare a single meal with one of your special ingredients. A crew member that spends at least 10 minutes doing nothing but eating and enjoying that meal gains resistance to a damage type based on the ingredient used. This resistance lasts 1 hour. Ingredients are as follows: ground black dragon bones for acid, yeti flesh for cold, fire salamander skin for fire, behir tail for lightning, wolf spider flesh for poison, beholder flesh for necrotic, mind flayer tentacles for psychic, ground unicorn horn for radiant, and ground bronze dragon bones for thunder."
  },
  {
    "job": "First Mate",
    "ability": "Protector of the Crew (at least Advanced in Engineer required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "You can cast the spell Life Transference once per day targeting your ship or any of your crew. Once you target your ship or a crew member with this spell you cannot cast this spell on the same target again in this way until you finish a long rest."
  },
  {
    "job": "First Mate",
    "ability": "Protector of the Crew (at least Advanced in Gunner required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "Once per round when one of your crew misses an attack you can use a reaction to allow them to reroll that attack. They must use the new roll."
  },
  {
    "job": "First Mate",
    "ability": "Protector of the Crew (at least Advanced in Helmsman required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "Your helmsman can concentrate on a spell in addition to concentrating on controlling the helm."
  },
  {
    "job": "First Mate",
    "ability": "Protector of the Crew (at least Advanced in Lookout required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "The entirety of your ship is under the effect of the spell Alarm with the audible effect active. Your crew and passengers known to you do not set off the spell's effect."
  },
  {
    "job": "First Mate",
    "ability": "Protector of the Crew (at least Advanced in Navigator required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "Your knowledge of the surrounding areas allows you to keep your crew guarded against extra-planar foes. Your entire crew is under the effects of the spell Protection from Evil and Good, but you can only choose one of the creature types. You must maintain concentration to give your crew this benefit. If you lose concentration on the spell you cannot regain concentration on this effect again until you finish a short or long rest. In addition you can change the chosen creature type once per week."
  },
  {
    "job": "First Mate",
    "ability": "Inspirational Leader",
    "rank": 5,
    "rankName": "expert",
    "description": "Whenever you spend a long rest with your crew you can give one of those crew members a point of inspiration. A point of inspiration allows that crew member to reroll an attack roll, ability check, or saving throw of their choice. After rerolling you have to take the new roll."
  },
  {
    "job": "First Mate",
    "ability": "Ship's Keeper (at least Intermediate in Engineer required)",
    "rank": 5,
    "rankName": "expert",
    "description": "Your ship is under the effect of the spell Death Ward. You can refresh this effect after a long rest on the ship."
  },
  {
    "job": "Gunner",
    "ability": "Artillery Operator",
    "rank": 1,
    "rankName": "green",
    "description": "You are proficient in using and loading ships' artillery. You can add your proficiency bonus to your attack roll when attacking with ships' artillery."
  },
  {
    "job": "Gunner",
    "ability": "Steady Shot (at least Intermediate in Lookout required)",
    "rank": 1,
    "rankName": "green",
    "description": "You gain a +1 bonus to attack rolls with ship's artillery whenever you have disadvantage on the attack."
  },
  {
    "job": "Gunner",
    "ability": "Boarder",
    "rank": 2,
    "rankName": "novice",
    "description": "You have advantage on Athletics or Acrobatics checks involved in boarding another ship."
  },
  {
    "job": "Gunner",
    "ability": "Burn 'em down (at least Novice in Cook required)",
    "rank": 2,
    "rankName": "novice",
    "description": "You know and can cast the cantrip Create Bonfire. If you do not have a spell save DC your spell save DC for this cantrip is 8 + your CON modifier + your proficiency bonus."
  },
  {
    "job": "Gunner",
    "ability": "Artillery Expert",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You gain a +2 bonus to all damage dealt with ships' artillery."
  },
  {
    "job": "Gunner",
    "ability": "Protective Guard (at least Novice in Helmsman required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can cast the spell Shield. You cannot cast this spell again in this way until you finish a short or long rest."
  },
  {
    "job": "Gunner",
    "ability": "Boarding Expert",
    "rank": 4,
    "rankName": "advanced",
    "description": "You have proficiency in your choice of Athletics or Acrobatics checks involved in boarding another ship. If you already have proficiency you double your proficiency for these checks."
  },
  {
    "job": "Gunner",
    "ability": "Ship Breaker (at least Advanced in Engineer required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "Choose a ship as your mark. Whenever you deal damage to that ship add an additional 1d6 damage of the same type of damage as your attack. You cannot mark a different ship in this manner until you finish a long rest."
  },
  {
    "job": "Gunner",
    "ability": "Versatile Marksman",
    "rank": 5,
    "rankName": "expert",
    "description": "You can add either your Strength or your Dexterity modifier to your attack and damage when you make an attack with ships' artillery. In addition you can cast the spell Searing Smite once per day. You cannot cast this spell again in this way until you finish a short or long rest. You can cast this spell with any kind of weapon attack or attack with ships' artillery."
  },
  {
    "job": "Gunner",
    "ability": "Ship's Guardian (at least Intermediate in First Mate required",
    "rank": 5,
    "rankName": "expert",
    "description": "You and your other crew members are under the effect of the spell Crusader's Mantle while they are on the ship or within a 30-foot radius of you."
  },
  {
    "job": "Gunner",
    "ability": "Distance Boarding (at least Novice in Navigator required)",
    "rank": 5,
    "rankName": "expert",
    "description": "Whenever you leap from your ship to board another, triple your jump distance."
  },
  {
    "job": "Helmsman",
    "ability": "Helm's Watch",
    "rank": 1,
    "rankName": "green",
    "description": "You can attune to a small or smaller Helm in order to control it."
  },
  {
    "job": "Helmsman",
    "ability": "Accustomed Eye (at least Green in First Mate required)",
    "rank": 1,
    "rankName": "green",
    "description": "You can accurately guess the size and speed of another ship that you can see clearly."
  },
  {
    "job": "Helmsman",
    "ability": "Helm's Watch",
    "rank": 2,
    "rankName": "novice",
    "description": "You can attune to a medium or smaller Helm in order to control it."
  },
  {
    "job": "Helmsman",
    "ability": "Quick Maneuvers",
    "rank": 2,
    "rankName": "novice",
    "description": "You increase the movement speed of your ship by 5ft. when you are the helmsman."
  },
  {
    "job": "Helmsman",
    "ability": "Guarded Helm (at least Intermediate in Gunner required)",
    "rank": 2,
    "rankName": "novice",
    "description": "Add +2 to your AC while you are at the helm."
  },
  {
    "job": "Helmsman",
    "ability": "Helm's Watch",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can attune to a large or smaller Helm in order to control it."
  },
  {
    "job": "Helmsman",
    "ability": "Resistant Helmsman",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You have resistance to any psychic damage you take from your Helm."
  },
  {
    "job": "Helmsman",
    "ability": "Quick Return (at least Intermediate in Navigator required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can cast the spell Dimension Door as long as your destination is your Helm. You cannot cast this spell again in this way until you finish a short or long rest."
  },
  {
    "job": "Helmsman",
    "ability": "Helm's Watch",
    "rank": 4,
    "rankName": "advanced",
    "description": "You can attune to a huge or smaller Helm in order to control it."
  },
  {
    "job": "Helmsman",
    "ability": "Battle-Hardened",
    "rank": 4,
    "rankName": "advanced",
    "description": "You have advantage on saving throws against Helmsman's Shock."
  },
  {
    "job": "Helmsman",
    "ability": "Helm's Watch",
    "rank": 5,
    "rankName": "expert",
    "description": "You can attune to a gargantuan or smaller Helm in order to control it."
  },
  {
    "job": "Helmsman",
    "ability": "Flexible Control",
    "rank": 5,
    "rankName": "expert",
    "description": "You can control a Helm as long as you are physically touching the ship that Helm is attached to."
  },
  {
    "job": "Helmsman",
    "ability": "Controlled Destruction (at least Advanced in Engineer required)",
    "rank": 5,
    "rankName": "expert",
    "description": "Halve the damage your ship takes while ramming or crashing."
  },
  {
    "job": "Lookout",
    "ability": "Watchman",
    "rank": 1,
    "rankName": "green",
    "description": "You can aptly stand watch and keep a proper lookout for a ship in transit."
  },
  {
    "job": "Lookout",
    "ability": "Helmsman's Aid (at least Green in Helmsman required)",
    "rank": 1,
    "rankName": "green",
    "description": "You can tell the the status of the ship's helm and other important elements of the ship like atmosphere and gravity while you are aboard the ship."
  },
  {
    "job": "Lookout",
    "ability": "Bearings",
    "rank": 2,
    "rankName": "novice",
    "description": "You can properly shoot a bearing to an object, determining its rough location (and sometimes distance) from the ship."
  },
  {
    "job": "Lookout",
    "ability": "Navigator's Aid (at least Green in Navigator required)",
    "rank": 2,
    "rankName": "novice",
    "description": "You can properly chart and keep a running bearing of the ship's location based on current bearing to major landmarks."
  },
  {
    "job": "Lookout",
    "ability": "Accustomed Eyesight",
    "rank": 3,
    "rankName": "intermediate",
    "description": "The vast darkness of space and dim light doesn't impose disadvantage on your perception or investigation checks."
  },
  {
    "job": "Lookout",
    "ability": "Engineer's Aid (at least Green in Engineer required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can repair the ship while on watch: you can do On-The-Go Repairs while standing watch."
  },
  {
    "job": "Lookout",
    "ability": "Eagle Eyes",
    "rank": 4,
    "rankName": "advanced",
    "description": "You have advantage on Perception checks while you are on watch."
  },
  {
    "job": "Lookout",
    "ability": "Gunner's Aid (at least Green in Gunner required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "You can gain advantage on an attack with ship's artillery. Once you use this ability you cant use it again until you finish a short or long rest."
  },
  {
    "job": "Lookout",
    "ability": "Versatile Watchman",
    "rank": 5,
    "rankName": "expert",
    "description": "You can serve as a lookout while performing any other role on the ship."
  },
  {
    "job": "Lookout",
    "ability": "First Mate's Aid (at least Green in First Mate required)",
    "rank": 5,
    "rankName": "expert",
    "description": "You can inspire other creatures that stand watch with you. Each creature that stands watch with you and listens to your tales for at least an hour can add +1 to their ability checks for the next 24 hours. This effect does not stack."
  },
  {
    "job": "Navigator",
    "ability": "Route Planning",
    "rank": 1,
    "rankName": "green",
    "description": "You know how to accurately read a celestial chart and plot a course through Wildspace to a given destination. You know how to use a sextant to calculate location based on known celestial objects. Depending on the accuracy of your charts and surroundings it can take you anywhere from 2 to 6 hours to properly calculate your location."
  },
  {
    "job": "Navigator",
    "ability": "Semaphore",
    "rank": 2,
    "rankName": "novice",
    "description": "You know a system of flags and flashing lights in order to communicate over distance to other ships and watch stations. You know and recognize a number of signal flags that ships use to display statues, warnings, and other information despite any language barrier."
  },
  {
    "job": "Navigator",
    "ability": "Magical Semaphore (at least Novice in Helmsman required)",
    "rank": 2,
    "rankName": "novice",
    "description": "You know and can cast the cantrip Dancing Lights."
  },
  {
    "job": "Navigator",
    "ability": "Celestial Navigation",
    "rank": 3,
    "rankName": "intermediate",
    "description": "You can change your route on the fly if problems arise. It takes you up to an hour to determine the rough changes necessary to the route. You can more accurately determine your location with a sextant. Depending on the accuracy of your charts and surroundings it can take you anywhere from 15 minutes to 1 hour to properly calculate your location."
  },
  {
    "job": "Navigator",
    "ability": "Elegant Semaphore (at least Novice in First Mate required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "When communicating via semaphore you know how to convey your point well despite your limited form of communication. You can make Intimidation and Persuasion checks via Semaphore communication."
  },
  {
    "job": "Navigator",
    "ability": "Calculated Trajectory (at least Advanced in Gunner required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "When attacking with the further distance when using ship's artillery you do not attack at disadvantage."
  },
  {
    "job": "Navigator",
    "ability": "Concealed Movement (at least Novice in Helmsman required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "Your knowledge of locating other celestial objects helps you hide yours. While you are the Helmsman or you are standing watch with your helmsman your ship gains +3 to its passive Stealth."
  },
  {
    "job": "Navigator",
    "ability": "Careful Planning",
    "rank": 4,
    "rankName": "advanced",
    "description": "When you plan a route with charts that don't exactly match up you can map your route with some accuracy in uncharted territory. You can better infer the safest route based on the information present on your charts allowing your ship safer passage."
  },
  {
    "job": "Navigator",
    "ability": "Unhindered (at least Advanced in Engineer required)",
    "rank": 4,
    "rankName": "advanced",
    "description": "You can cast the spell Freedom of Movement. You cannot cast this spell again in this way until you finish a long rest."
  },
  {
    "job": "Navigator",
    "ability": "Flow Charts",
    "rank": 5,
    "rankName": "expert",
    "description": "You can, as accurately as possible, plan routes from one Crystal Sphere to another."
  },
  {
    "job": "Navigator",
    "ability": "Honing In (Expert in Lookout required)",
    "rank": 5,
    "rankName": "expert",
    "description": "You know and can cast the spell Find the Path. When you cast the spell in this way you do not need any materials except the object from the location you wish to find. Once you cast this spell in this way you cannot cast it again for a week."
  },
  {
    "job": "Captain",
    "ability": "Combat Captain",
    "rank": 1,
    "rankName": "green",
    "description": "At the beginning of each round of combat you may swap your initative with another memember of the crew."
  },
  {
    "job": "Captain",
    "ability": "Morale Manager (at least Green in First Mate required)",
    "rank": 1,
    "rankName": "green",
    "description": "When your ship comes under attack you may cast the bless spell targeting any three crew members aboard the ship."
  },
  {
    "job": "Captain",
    "ability": "Pilot",
    "rank": 2,
    "rankName": "novice",
    "description": ""
  },
  {
    "job": "Captain",
    "ability": "Speed Demon (at least Novice in Engineer required)",
    "rank": 2,
    "rankName": "novice",
    "description": "As an action you can give an order to your helmsman to go full speed ahead. The ships movement increases by your proficiency bonus until the end of your next turn."
  },
  {
    "job": "Captain",
    "ability": "Sailor",
    "rank": 3,
    "rankName": "intermediate",
    "description": ""
  },
  {
    "job": "Captain",
    "ability": "Ships' Status (at least Green in Navigator required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": ""
  },
  {
    "job": "Captain",
    "ability": "Jack of All Trades",
    "rank": 4,
    "rankName": "advanced",
    "description": ""
  },
  {
    "job": "Captain",
    "ability": "Swashbuckler (at least Intermediate in Gunner required)",
    "rank": 4,
    "rankName": "advanced",
    "description": ""
  },
  {
    "job": "Captain",
    "ability": "Old Salt",
    "rank": 5,
    "rankName": "expert",
    "description": "You can fill any role on a ship in addition to any other crew members holding that role. You can do this even if that role is normally only held by a single crew member."
  },
  {
    "job": "Medical Officer",
    "ability": "Practiced Hand",
    "rank": 1,
    "rankName": "green",
    "description": "All healing done within your designated space is concidered to have rolled its maximum."
  },
  {
    "job": "Medical Officer",
    "ability": "Emboldening Medic (at least Green in Security Officer required)",
    "rank": 1,
    "rankName": "green",
    "description": "When you heal a crew member in combat they gain temporary HP equal to you proficiency in the role plus your proficiency bonus. While a crew member has these Temporary HP they can not be frightened."
  },
  {
    "job": "Medical Officer",
    "ability": "Make Shift Mender (at least Green in First Mate required)",
    "rank": 2,
    "rankName": "novice",
    "description": "Once per long rest you can cast the spell Revivify."
  },
  {
    "job": "Medical Officer",
    "ability": "Sailor",
    "rank": 3,
    "rankName": "intermediate",
    "description": ""
  },
  {
    "job": "Medical Officer",
    "ability": "Stocked Doc (at least Green in Chef required)",
    "rank": 3,
    "rankName": "intermediate",
    "description": "At the end of each long rest you may roll a medicine check to create a potion of healing. A DC 15 makes a general healing potion. For every 5 point of success beyond the DC the rarity of the potion is increased."
  },
  {
    "job": "Security Officer",
    "ability": "Drill Runner",
    "rank": 1,
    "rankName": "green",
    "description": "You can spend time outside of combat preparing your crew for person to person combat. As long as you spend one day every 4 long rests doing this training all crew memember start a convential combat with a d6 that they can add to one Attack Roll or Saving Throw."
  },
  {
    "job": "Security Officer",
    "ability": "Entry Extpert (at least Green in Look Out required)",
    "rank": 1,
    "rankName": "green",
    "description": "Should another vessel attempt to board your ship your knowledge of boarding prevents your crew from being suprised in boardings."
  },
  {
    "job": "Security Officer",
    "ability": "Pilot",
    "rank": 2,
    "rankName": "novice",
    "description": ""
  }
]