{
  "Cook":[
      {
        "ability":"Ships Cook",
        "rank":1,
        "rankName":"green",
        "description":"When purchasing rations and supplies you can appropriately buy the necessary food to sustain the ships crew with a healthy and balanced diet. As long as you have adequate spices and flavorings you can make enjoyable meals out of magically created sustenance. You can prepare a meal for the entire crew in 30 minutes. If you do 1 hour of preparation the next 3 meals you make within 24 hours only take 5 minutes to prepare. A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared regains 1d10 hitpoints. A creature can only gain this benefit from your food once a day."
      },
      {
        "ability":"Restful Meal",
        "rank":2,
        "rankName":"novice",
        "description":"A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared gains the benefits of a short rest. A creature can only gain this benefit from your food once a day."
      },
      {
        "ability":"Pots and Pans (at least Novice in Gunner required)",
        "rank":2,
        "rankName":"novice",
        "description":"You are proficient with your cooking implements when using them as improvised weapons. Your utensils deal 1d6 damage and are considered light. The damage type can be bludgeoning, piercing, or slashing damage based on the utensil type. A utensil can have other properties (finesse, thrown, etc.) depending on the utensil, ask your DM if you have an idea in mind."
      },
      {
        "ability":"Antitoxin",
        "rank":3,
        "rankName":"intermediate",
        "description":"A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared is cured of one poison affecting it. A creature can only gain this benefit from your food once a day."
      },
      {
        "ability":"Bottled Antitoxin (at least Green in Engineer required)",
        "rank":3,
        "rankName":"intermediate",
        "description":"You can create one dose of antitoxin during a long rest that can be drank to remove one poison affecting the creature. This dose remains potent until you create another dose this way."
      },
      {
        "ability":"Local Cuisine (at least Novice in Navigator required)",
        "rank":3,
        "rankName":"intermediate",
        "description":"You can prepare food similar to the local food at a destination if you know that place or places similar in culture."
      },
      {
        "ability":"Hearty Meal",
        "rank":4,
        "rankName":"advanced",
        "description":"A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared can gain one of the following benefits: They gain the benefit of the spell Gift of Alacrity or they have advantage on Wisdom ability checks for the next 8 hours. You choose which of the two benefits come from the meal when you prepare it. A creature can only gain this benefit from your food once a day."
      },
      {
        "ability":"Consistent Cook",
        "rank":4,
        "rankName":"advanced",
        "description":"While your ship is out of supplies you can create enough food and water to keep your crew alive as if by the spell Create Food and Water. You can only do this once per day."
      },
      {
        "ability":"Fulfilling Meal",
        "rank":5,
        "rankName":"expert",
        "description":"A creature that spends at least 10 minutes doing nothing but eating and enjoying a meal you prepared can increase their current and maximum hitpoints by 1d12 or regain a spent hit die. You choose which of the two benefits come from the meal when you prepare it. A creature who gains maximum hitpoints from this feature keeps that increase for the next 24 hours. A creature can only gain this benefit from your food once a day."
      },
      {
        "ability":"Leader's Meal (Expert in First Mate required)",
        "rank":5,
        "rankName":"expert",
        "description":"Once a day when you prepare a meal with at least 750 gp in food and drink used in the meal you can serve the meal while giving a rousing speech to the crew. A creature that spends at least 1 hour doing nothing but listening to you, eating, and enjoying the meal gains the benefits of the spell Heroes' Feast. A creature can only gain this benefit from your food once a day."
      }
  ],
  "Engineer":[
    {
      "ability":"On-The-Go Repairs",
      "rank":1,
      "rankName":"green",
      "description":"You can spend time outside of combat to patch up the ship. For each hour you spend outside of combat repairing the ship it regains 1d4 temporary hitpoints. The ship keeps these temporary hitpoints as long as your repairs hold up (often repairs only last a few days to a few weeks without having to spend more time and materials to keep up the patchwork repairs)."
    },
    {
      "ability":"Ship Status (at least Green in Helmsman required)",
      "rank":1,
      "rankName":"green",
      "description":"You can accurately tell when your ship drops below three-quarters, half, and one-quarter of its maximum hitpoints."
    },
    {
      "ability":"Damage Control",
      "rank":2,
      "rankName":"novice",
      "description":"When you make a Survival check during combat to attempt to fix a functional portion of the ship or put out a spreading fire you have advantage on the check."
    },
    {
      "ability":"Exact Status (at least Intermediate in Helmsman required)",
      "rank":2,
      "rankName":"novice",
      "description":"While attuned to the ship you know its exact hitpoints and statuses."
    },
    {
      "ability":"Repairman",
      "rank":3,
      "rankName":"intermediate",
      "description":"Whenever you would give temporary hitpoints to the ship with On-The-Go Repairs you instead can properly repair the damage, restoring as many hitpoints as the temporary hitpoints you would have restored."
    },
    {
      "ability":"Hull Coating (at least Intermediate in Navigator required)",
      "rank":3,
      "rankName":"intermediate",
      "description":"You can refurbish the ship's hull to protect against the dangers of Wildspace Poison. When creatures are belowdecks they are not exposed to and do not need to save against Wildspace Poison."
    },
    {
      "ability":"Lookout Post (at least Intermediate in Lookout required)",
      "rank":3,
      "rankName":"intermediate",
      "description":"You can create a lookout post to aid in watches. Lookouts using your post add +3 to their passive perception."
    },
    {
      "ability":"Kitchen Overhaul (at least Intermediate in Cook required)",
      "rank":3,
      "rankName":"intermediate",
      "description":"You refurbish the ship's kitchen, allowing your cook more efficient and easier preparation of meals. Your cook can prepare a meal for the entire crew in 15 minutes. If your cook spends 1 hour of preparation, the next three meals they serve within the next 24 hours are fully prepared and you can they serve those meals directly to the crew when the time to eat comes up."
    },
    {
      "ability":"Comfortable Helm (at least Intermediate in Helmsman required)",
      "rank":3,
      "rankName":"intermediate",
      "description":"You add a few nice features to the Helm in order to make it easier to stand watch on. Helmsmen on watch can now stand for a full 16 hours instead of 8 before incurring exhaustion."
    },
    {
      "ability":"Mounted Artillery (at least Intermediate in Gunner required)",
      "rank":3,
      "rankName":"intermediate",
      "description":"You can adjust and increase the effectiveness of mounted artillery. All artillery you adjust gains +1 to all attack rolls with that artillery."
    },
    {
      "ability":"Efficient Repair",
      "rank":4,
      "rankName":"advanced",
      "description":"When you make a Survival check to attempt to fix a functional portion of the ship or put out a spreading fire you can do so as a bonus action instead of an action."
    },
    {
      "ability":"Lightning Repair (at least Advanced in First Mate required)",
      "rank":4,
      "rankName":"advanced",
      "description":"The first time you make a Survival check to attempt to fix a functional portion of the ship or put out a spreading fire on your turn you can choose to use a free action to make the check instead of a bonus action."
    },
    {
      "ability":"Marksman (at least Intermediate in Gunner required)",
      "rank":4,
      "rankName":"advanced",
      "description":"Your knowledge of ships and their workings increases your ability to disable them. Your attacks using a ship's artillery against another ship critically strikes on a 19 or 20."
    },
    {
      "ability":"Boatswain",
      "rank":5,
      "rankName":"expert",
      "description":" Whenever you perform or oversee On-The-Go Repairs for at least 8 hours in a single day you can repair one instance of Structural Damage. You can only repair one instance per day. Whenever you restore hitpoints to the ship, double the total number of hitpoints restored."
    },
    {
      "ability":"Expert Marksman (Expert in Gunner required)",
      "rank":5,
      "rankName":"expert",
      "description":"Your knowledge of ships and their workings further increases your ability to disable them. Once per long rest when you make an attack using a ship's artillery against another ship, you can replace the damage of the artillery you are using with the damage and effects of the spell Disintegrate."
    }
    ],
    "First Mate":[
      {
        "ability":"",
        "rank":1,
        "rankName":"green",
        "description":""
      },
      {
        "ability":"",
        "rank":1,
        "rankName":"green",
        "description":""
      },
      {
        "ability":"",
        "rank":2,
        "rankName":"novice",
        "description":""
      },
      {
        "ability":"",
        "rank":3,
        "rankName":"intermediate",
        "description":""
      },
      {
        "ability":"",
        "rank":3,
        "rankName":"intermediate",
        "description":""
      },
      {
        "ability":"",
        "rank":4,
        "rankName":"advanced",
        "description":""
      },
      {
        "ability":"",
        "rank":4,
        "rankName":"advanced",
        "description":""
      },
      {
        "ability":"",
        "rank":4,
        "rankName":"advanced",
        "description":""
      },
      {
        "ability":"",
        "rank":4,
        "rankName":"advanced",
        "description":""
      },
      {
        "ability":"",
        "rank":4,
        "rankName":"advanced",
        "description":""
      },
      {
        "ability":"",
        "rank":4,
        "rankName":"advanced",
        "description":""
      },
      {
        "ability":"",
        "rank":5,
        "rankName":"expert",
        "description":""
      },
      {
        "ability":"",
        "rank":5,
        "rankName":"expert",
        "description":""
      }
      ]
}

[
{
  "ability":"",
  "rank":1,
  "rankName":"green",
  "description":""
},
{
  "ability":"",
  "rank":2,
  "rankName":"novice",
  "description":""
},
{
  "ability":"",
  "rank":3,
  "rankName":"intermediate",
  "description":""
},
{
  "ability":"",
  "rank":4,
  "rankName":"advanced",
  "description":""
},
{
  "ability":"",
  "rank":5,
  "rankName":"expert",
  "description":""
}
],